from pydantic import BaseModel

rooms = {} 
admins = {}
selected_verse_for_room = {}

shevchenko_poems = {
    1: """
Сонце заходить, гори чорніють,
Пташечка тихне, поле німіє,
Радіють люди, що одпочинуть...
Я дивлюся... і серцем лину
В темний садочок на Україну.
""",
    2: """
Ой стрічечка до стрічечки,
Хусточка до пари,
Чом же нема єдиного
Мого ясеняра?
""",
    3: """
На улиці скрипка грає,
Парубки танцюють,
А я, молоденька,
Стою та сумую.
""",
    4: """
Не женися на багатій,
Бо вижене з хати,
Не женися на убогій,
Бо не буде хати.
""",
    5: """
Зоря моя вечірняя,
Зійди над горою,
Поговорим тихесенько
В неволі з тобою.
""",
    6: """
This, is a test text.
Hello, world!
"""
}
